package 기본프로그램; // 접근제한자(캡슐화)와 연관성이 있음
/*
여기는 범위 주석
주석이란? 사람은 이해하고 컴파일러는 무시하는 영역
 */
// 접근제한자 : public, protected, default, private
// ※ 클래스와 파일명은 같아야 함.
// 하나의 파일 내에서 public은 한 번만 선언이 가능함!
public class Sample { // class 이름을 지정, 클래스 이름은 관례 상 첫자를 대문자로 사용해야함!
    // main - 메소드는 프로그램의 시작위치를 의미하며 JVM이 호출함.
    // static - 정적 변수를 의미하며, 객체로 생성이 불가능하고 유일하다는 의미임
    // void - 메소드 실행 이후의 반환 타입 중 하나로 실행결과를 뜻함.
    // {} 중괄호 : 클래스, 메소드 등의 범위를 지정
    // () 소괄호 : 메소드의 매개변수를 넣는 곳
    // [] 대괄호 : 배열 등을 정의할 때 사용됨
    public static void main(String[] args) {

    }
}
